Repository: lamber-k/CanadaCitizenship
Catalog: CanadaCitizenship.Blazor/Pages/Home.*.resx
Languages: fr

# Title
source: Canada Citizenship Calculator
fr: Calculateur Citoyenneté Canada

# ParametersSectionHeader
source: Parameters
fr: Paramètres

# FirstEntryLabel
source: First Entry
fr: Date d'entrée

# PRLabel
source: Permanent Residency
fr: Date Résidence permanente

# AddPeriodLabel
source: Add Period
fr: Ajouter Période

# TablePeriodBeginHeaderTitle
source: Begin
fr: Début

# TablePeriodEndHeaderTitle
source: End
fr: Fin

# ResultSection
source: Result
fr: Résultat

# TablePeriodNameHeaderTitle
source: Name
fr: Nom

# Header
source: Canada Citizenship Calculator
fr: Calculateur Citoyenneté Canada

# DialogCreateProfileTitle
source: Create Profile
fr: Créer Profile

# DialogImportProfilesTitle
source: Import Profiles
fr: Importer Profiles

# DialogSwitchCultureTitle
source: Language Selector
fr: Sélecteur de Langue

# ContextMenuNewProfileText
source: New Profile
fr: Ajouter Profile

# ContextMenuDeleteProfileText
source: Delete Profile
fr: Supprimer Profile

# ContextMenuImportProfilesText
source: Import Profiles
fr: Importer Profiles

# ContextMenuSaveProfilesText
source: Save Profiles
fr: Sauvegarder Profiles

# ContextMenuSwitchCultureText
source: Change Language
fr: Changer Langue

# IntroText
source: This tool helps you determine how many days can be considered when you'll apply for your citizenship. Please note that this tool is not official and will only provide you insights and an estimated date.
fr: Cet outil vous permet de déterminer le nombre de jours pouvant être considérés lors de votre application pour la citoyenneté. Attention: Cet outil n'est pas officiel et vous donnera seulement des estimations.

# HTMLMoreInfoText
source: Please see <a href="https://eservices.cic.gc.ca/rescalc/resCalcStartNew.do?lang=en" target="_blank">Physical Presence Calculator</a> for more details.
fr: Pour plus d'informations, référez-vous à <a href="https://eservices.cic.gc.ca/rescalc/resCalcStartNew.do?lang=fr" target="_blank">Calculatrice de la période de présence effective</a>.

# ExclusionPeriodText
source: Please add all the past and future periods that needs to be excluded (i.e you were not physically in Canada, or did not have a valid temporary status). The begin and end date are considered to be in Canada. Example: Leaving Canada from 2024-05-28 to 2024-06-12. For both May 28th and June 12th, you are considered in Canada as you are leaving/returning at these dates.
fr: Ajoutez toutes les périodes passées et futures qui doivent être exclues (càd non présent physiquement au Canada ou sans statut temporaire valide). La date de début et de fin sont considérés comme présence effective au Canada. Exemple: Quitter le territoire du 2024-05-28 au 2024-06-12. Le 28 mai et le 12 juin seront considérés comme présence effective au Canada.

# ErrorMenuClickAction
source: Action {0} failed to execute.
fr: {0} a échoué.

# ErrorComputationTitle
source: Result
fr: Résultat

# ExclusionPeriodDeleteConfirmText
source: Are you sure you want to delete this period ?
fr: Êtes-vous sûr de vouloir supprimer cette période ?

# ExclusionPeriodDeleteConfirmTitle
source: Delete period
fr: Supprimer période

# CancelBtn
source: Cancel
fr: Annuler

# ConfirmBtn
source: Confirm
fr: Confirmer

# ProfileDeleteConfirmText
source: Are you sure you want to delete this profile ?
fr: Êtes-vous sûr de vouloir supprimer ce profile ?

# ProfileDeleteConfirmTitle
source: Delete profile
fr: Supprimer profile

# EnumPeriodVacation
source: Vacations
fr: Vacances

# EnumPeriodNone
source: None
fr: Aucun

# EnumPeriodPR
source: Permanent Resident
fr: Résident Permanent

# EnumPeriodTemporary
source: Valid temporary permit
fr: Détenteur permis valide

# EnumPeriodTourist
source: Tourist status
fr: Statut touriste

# EnumPeriodNoStatus
source: No valid status
fr: Aucun statut

# EnumPeriodOther
source: Other
fr: Autre
